import React from "react"
import Latex from "react-latex"
import BEM from "../../../helpers/BEM.js"
import "../Article.scss"
const b = BEM("Article")

const Subchapter_8_1 = () => (
  <section>
    <h1 className={b("header")}>Стійкість мереж до атак</h1>
    <div className={b("illustration", ["sticky", "ref"])}>
      Про{" "}
      <a href={"https://hromadske.ua/posts/u-londoni-straik-pratsivnykiv-metro-paralizuvav-tsentr-mista"}>
        лондонський транспортний колапс
      </a>
    </div>
    <p className={b("paragraph")}>
      9 січня 2017{" "}
      <a href={"https://hromadske.ua/posts/u-londoni-straik-pratsivnykiv-metro-paralizuvav-tsentr-mista"}>
        робітники Лондонського метро вийшли на страйк
      </a>
      . 114 із 270 станцій метрополітену припинили роботу. Ще 75 працювали в обмеженому режимі. Припинення роботи
      найпопулярнішого транспорту в місті призвело до коллапсу. Сотні людей стояли в чергах на автобуси. Залізничні
      маршрути були переповнені. На станції Clapham Junction через скупчення натовпу провели евакуацію. До деяких частин
      міста зникли сполучення. Багато жителів просто не змогли добратись на роботу. Лондонська мережа виявилась не
      готовою до вилучення 114 станцій. А як можна було це передбачити?
    </p>
    <div className={b("illustration", ["sticky", "ref"])}>
      Про{" "}
      <a href={"https://onlinelibrary.wiley.com/doi/abs/10.1002/rsa.3240060204"}>
        критерій Моллоя-Ріда <Latex>{"$\\kappa$"}</Latex>
      </a>
    </div>
    <p className={b("paragraph")}>
      Стійкість мережі до "випадіння" вузлів можна дослідити різними способами. Один із них -{" "}
      <a href={"https://onlinelibrary.wiley.com/doi/abs/10.1002/rsa.3240060204"}>
        критерій Моллоя-Ріда <Latex>{"$\\kappa$"}</Latex>
      </a>
      . Із критерієм Моллоя-Ріда, маючи лише загальні показники мереж, ми можемо спрогнозувати їх стійкість до
      випадкових вилучень вузлів. Вважається, що мережа є стійкою, якщо в ній існує найбільша зв'язна компонента GCC.
      Найбільша зв’язна компонента - це найбільший підграф мережі, у якому між будь-якими двома вузлами є шлях. За
      критерієм Моллоя-Ріда, GCC існує в мережі, якщо{" "}
      <Latex>{"$ \\kappa = \\frac { k^{2 avg}} {k^{avg}} \\geqslant 2$"}</Latex>, де <Latex>{"$k^{avg}$"}</Latex> -
      середній ступінь вузлів у мережі, a <Latex>{"$k^{2 avg}$"}</Latex> - середній квадратний ступінь вузла. Чим більше
      значення <Latex>$\\kappa$</Latex>, тим стабільнішою є мережа.
    </p>
    <p className={b("paragraph")}>
      Критерій Моллоя-Ріда є найбільш корисним в <Latex>{"$\\mathbb L$"}</Latex>-space, бо мережі в{" "}
      <Latex>{"$\\mathbb P$"}</Latex>- і <Latex>{"$\\mathbb C$"}</Latex>-space сильно зв'язні і їх{" "}
      <Latex>{"$\\kappa$"}</Latex> зазвичай дуже високі. В <Latex>{"$\\mathbb L$"}</Latex>-space{" "}
      <Latex>{"$ \\kappa_{LWO} = 3.1$"}</Latex>, <Latex>{"$\\kappa_{BRS} = 4.5$"}</Latex>. Тому мережі є стійкими до
      випадкових випадінь вузлів. І можна припустити, що транспортна система Брістоля в <Latex>{"$\\mathbb L$"}</Latex>
      -space є стабільнішою.
    </p>
    {/*add table here*/}
    <p className={b("paragraph")}>
      Однак несправності у мережі бувають не тільки випадковими. Терористичні акти чи страйки спрямовують на
      найважливіші зупинки транспортної системи, щоби завдати їй найбільшої шкоди. Стійкість мережі за різних сценаріїв
      можна перевірити симуляціями атак. У дослідженні ми провели декілька сценаріїв симуляцій:
    </p>
    <ul>
      <li>випадкові "випадіння" зупинок</li>
      <li>
        спрямовані атаки на найважливіші вузли:
        <ul>
          <li> атаки на вузли із найбільшим ступенем k</li>
          <li>
            атаки на вузли із найбільшою проміжною центральністю <Latex>{"$C_{\\beta}$"}</Latex>
          </li>
        </ul>
      </li>
    </ul>
    <p className={b("paragraph")}>
      У спрямованих атаках вузли сортують у "списки важливості" в порядку спадання і починають видаляти із початку
      списку. Після атаки на один вузол порядок важливості інших може змінитися. Тому симуляції спрямованих атак мають
      два підвиди:
    </p>
    <ul>
      <li>видалення вузлів із початкового "списку важливості"</li>
      <li>видалення вузлів із пересортуванням "списку важливості" після кожного кроку симуляції</li>
    </ul>
    <p className={b("paragraph")}>Симуляція для кожного зі сценаріїв відбувається так:</p>
    <ol>
      <li>Видаляємо 1% вузлів мережі за обраним сценарієм</li>
      <li>
        Обчислюємо розмір <Latex>{"$S$"}</Latex> найбільшої зв'язної компоненти GCC відносно початкового розміру мережі:
        <Latex>{"$S=\\frac{N_{GCC}} {N}$"}</Latex>, де <Latex>{"$N_{GCC}$"}</Latex> - кількість вузлів у GCC, а{" "}
        <Latex>{"$N$"}</Latex> - початкова кількість вузлів у мережі.
      </li>
      <li>Повторюємо кроки 1 і 2, поки не видалимо всі вузли мережі.</li>
    </ol>
    <p className={b("paragraph")}>
      Після симуляції для кожного виду атак ми створюємо графік залежності <Latex>{"$S$"}</Latex> від частки видалених
      зупинок <Latex>{"$c$"}</Latex>. Далі обраховуємо площу <Latex>{"$A$"}</Latex> під кожною кривою на графіку:{" "}
      <Latex displayMode={true}>{"$A = \\int_{0}^{1} S(c) dc$"}</Latex> Чим менша <Latex>{"$A$"}</Latex>, тим швидше
      руйнує мережу певний вид атаки.
    </p>
    <p className={b("paragraph")}>Видалення вузла у кожному з відображень має окреме значення.</p>
    <p className={b("paragraph")}>
      <b>
        B <Latex>$\mathbb L$</Latex>-space
      </b>
      : видалення вузла роз’єднує маршрут. Можливо на зупинці трапилась аварія і автомобілі загородили проїзд. Зупинку
      об’їжджають іншими шляхами.
    </p>
    <p className={b("paragraph")}>
      <b>
        В <Latex>$\mathbb P$</Latex>-space
      </b>
      : один вузол забрали із маршруту, але між іншими вузлами того ж маршруту досі є зв’язки. Можливо зупинку вирішили
      відмінити. Автобус проїжджає тією ж дорогою, але більше там не зупиняється.
    </p>
    <p className={b("paragraph")}>
      <b>
        В <Latex>$\mathbb C$</Latex>-space
      </b>
      : маршрут відмінили.
    </p>
  </section>
)

export default Subchapter_8_1
