import React from "react"
import Trigger from "../Trigger"
import londonBusNetwork from "../../images/london_bus_network_1.png"
import bristolBusNetwork from "../../images/bristol_bus_network.png"
import lvivBusNetwork from "../../images/lviv_bus_network.png"
import trafficJam from "../../images/traffic_jam.png"
import * as BristolLSpace from "../../images/bristolLSpace.png"
import * as BristolCSpace from "../../images/bristolCSpace.png"
import { ReactComponent as ExampleLSpace } from "../../images/exampleLSpace.svg"
import { ReactComponent as ExamplePSpace } from "../../images/examplepSpace.svg"
import { ReactComponent as ExampleCSpace } from "../../images/exampleCSpace.svg"
import "./Article.scss"
const Article = () => (
  <div className={"Article"}>
    <header className={"Article__chapter"}>Вступ</header>
    <h1 className={"Article__header"}>Опис&nbsp;проблеми & Історичний&nbsp;прецедент</h1>
    <p className={"Article__paragraph Article__paragraph_first"}>
      <Trigger data={{ name: "Bristol" }}>Bristol bus network</Trigger>
      Робота транспортної системи - важливий аспект життя кожного міста.
      <Trigger data={{ name: "Second" }}>Second bus network</Trigger>
      Для створення стабільної і добре структурованої мережі громадського транспорту важливо не тільки забезпечити
      пасажирам якнайшвидше добирання до будь-якого пункту із найменшою кількістю пересадок, але й подбати про безпеку
      при виникненні непередбачуваних ситуацій у мережі.
      <Trigger data={{ name: "Third" }}>Third bus network</Trigger>
    </p>
    <p className={"Article__paragraph"}>
      <Trigger data={{ space: "First space" }}>Space1</Trigger>
      Нестійка мережа може швидко розвалитися як через випадкові "випадання" зупинок, так і при спрямованих атаках.
      Випадкові події включають у себе аварії, сильні затори чи навіть погані погодні умови у певній частині мережі,
      через що частина зупинок чи навіть увесь маршрут стають недоступними.
      <img className={"Article__image"} src={trafficJam} alt={"Traffic Jam"} />
      <Trigger data={{ space: "Second space" }}>Space2</Trigger>
      Та ще більш небезпечними є спрямовані атаки, наприклад, страйк на одній із зупинок чи терористичний акт. Такі
      події зазвичай трапляються у найбільш зв'язних точках мережі, так званих хабах, які є найбільш важливими для всієї
      мережі, оскільки обслуговують велику кількість маршрутів.      Та ще більш небезпечними є спрямовані атаки, наприклад, страйк на одній із зупинок чи терористичний акт. Такі
      події зазвичай трапляються у найбільш зв'язних точках мережі, так званих хабах, які є найбільш важливими для всієї
      мережі, оскільки обслуговують велику кількість маршрутів.      Та ще більш небезпечними є спрямовані атаки, наприклад, страйк на одній із зупинок чи терористичний акт. Такі
      події зазвичай трапляються у найбільш зв'язних точках мережі, так званих хабах, які є найбільш важливими для всієї
      мережі, оскільки обслуговують велику кількість маршрутів.      Та ще більш небезпечними є спрямовані атаки, наприклад, страйк на одній із зупинок чи терористичний акт. Такі
      події зазвичай трапляються у найбільш зв'язних точках мережі, так званих хабах, які є найбільш важливими для всієї
      мережі, оскільки обслуговують велику кількість маршрутів.      Та ще більш небезпечними є спрямовані атаки, наприклад, страйк на одній із зупинок чи терористичний акт. Такі
      події зазвичай трапляються у найбільш зв'язних точках мережі, так званих хабах, які є найбільш важливими для всієї
      мережі, оскільки обслуговують велику кількість маршрутів.      Та ще більш небезпечними є спрямовані атаки, наприклад, страйк на одній із зупинок чи терористичний акт. Такі
      події зазвичай трапляються у найбільш зв'язних точках мережі, так званих хабах, які є найбільш важливими для всієї
      мережі, оскільки обслуговують велику кількість маршрутів.      Та ще більш небезпечними є спрямовані атаки, наприклад, страйк на одній із зупинок чи терористичний акт. Такі
      події зазвичай трапляються у найбільш зв'язних точках мережі, так званих хабах, які є найбільш важливими для всієї
      мережі, оскільки обслуговують велику кількість маршрутів.
      <Trigger data={{ space: "Third space" }}>Space3</Trigger>
    </p>
  </div>
)

export default Article
