import React from "react"
import Latex from "react-latex"

import BEM from "../../helpers/BEM.js"
import "./Article.scss"

const b = BEM("Article")

const Chapter_9 = () => (
  <section id={"chapter9"}>
    <h1 className={b("header")}>Топологічні характеристики в P space</h1>
    <p className={b("paragraph")}>
      Брістоль і Львів - схожі за розміром міста. Однак у транспортних системах міст є багато відмінностей. Кількість
      вузлів та ребер у Брістолі майже вдвічі вища, за львівську. У Брістолі зупинки краще пов’язані між собою, ніж у
      Львові (вище значення <Latex>$C$</Latex>). Та у львівській мережі є більше зв’язків між маршрутами. Брістольська
      мережа є стійкішою за львівську до атак на зупинки і менш стійкою до атак на цілі маршрути. Однак, в обох мереж
      схожа реакція на різні сценарії атак. Найменшу загрозу мають випадкові атаки на зупинки чи маршрути. Здавалося б,
      найбільш вразливі - вузли із великою кількістю зв’язків. Та для обох міст найнебезпечнішими є атаки (із
      пересортуванням) на зупинки чи маршрути із високою центральністю посередництва.
    </p>
  </section>
)

export default Chapter_9
