import React from "react"
import BEM from "../../helpers/BEM.js"
import "./Article.scss"

const b = BEM("Article")

const Chapter_10 = () => (
  <section id={"chapter10"}>
    <h1 className={b("header")}>Що далі?</h1>
    <p className={b("paragraph")}>
      У цьому дослідженні ми вивчаємо “скелети” мереж, базуючись на статичних даних. Наступний крок - дослідити мережі
      разом із їх динамічними процесами. Можна вивчити зміни кількості транспорту і пасажиропотоків протягом дня. Варто
      врахувати максимальну пропускну здатність зупинок та шляхів під час симуляцій. У таких симуляціях випадання одного
      вузла спричиняє зміну навантаження на інші вузли. Якщо навантаження на вузол перевищує його пропускну здатність,
      він також "випадає". Так можна буде дослідити “каскадні” руйнування мережі.
    </p>
  </section>
)

export default Chapter_10
