import React from "react"
import BEM from "../../helpers/BEM.js"
import "./Article.scss"

const b = BEM("Article")

const Chapter_10 = () => (
  <section id={"chapter10"}>
    <h1 className={b("header")}>Що далі?</h1>
    <p className={b("paragraph")}>
      У цьому дослідженні ми вивчаємо “скелети” мереж, базуючись на статичних даних. Наступний крок - дослідити мережі
      разом із їх динамічними процесами. Врахувати максимальну пропускну здатність зупинок та шляхів, зміни
      пасажиропотоків протягом дня. Провести симуляції атак на динамічній мережі. У такій мережі випадання одного вузла
      може спричинити перевищення пропускної здатності на інших вузлах. Так можна буде дослідити “каскадні” руйнування
      мережі.
    </p>
  </section>
)

export default Chapter_10
