import React from "react"
import Latex from "react-latex"
import BEM from "../../helpers/BEM.js"
import "./Article.scss"
const b = BEM("Article")

const Chapter_3 = () => (
  <section>
    <h1 className={b("header")}>Історія трьох міст</h1>

    <h2>Лондон</h2>
    <p>Короткий історичний ракурс і проблематики Лондона. </p>

    <h2>Брістоль</h2>
    <p>Короткий історичний ракурс і проблематики Брістоля. </p>

    <h2>Львів</h2>
    <p>Короткий історичний ракурс і проблематики Львова. </p>

    <h3>Цифри.</h3>

    <p className={b("paragraph", ["first"])}>
      Завдяки проведеним дослідженням науковці помітили, що набір певних характеристик у багатьох мереж транспорту
      незалежно від розміру є подібним. Однак існують ознаки, між якими часто відсутня кореляція. Для розуміння
      функціонування мереж та знаходження шляхів для їх оптимізації важливо навчитися відслідковувати як наявність, так
      і відсутність закономірностей.
    </p>
    <p className={b("paragraph")}>
      Для проведення дослідження ми обрали три різні транспортні системи: автобусні маршрути Лондона та Брістоля і
      мережу громадського транспорту Львова. У Лондоні - 767 маршрутів зі 16397 зупинками.
      <img className={b("image")} alt="London Bus Network" src="img/london_bus_network_1.png" /> Автобусна мережа
      Брістоля налічує 2873 зупинки, які входять до 143 маршрутів.{" "}
      <img className={b("image")} alt="Bristol Bus Network" src="img/bristol_bus_network.png" />
      Мережа Львова налічує 100 міських маршрутів, що обслуговують 771 зупинку.{" "}
      <img className={b("image")} alt="Lviv Bus Network" src="img/lviv_bus_network.png" />
      Таким чином ми мали змогу порівняти характеристики трьох різних за розміром та систем.
    </p>
    <h2 className={b("chapter")}>Лондон та Брістоль</h2>
    <p className={b("paragraph", ["first"])}>
      Дослідження для Лондона та Брістоля в <Latex>$L$</Latex> просторі проводили раніше. Ці результати, а також аналіз
      транспортних систем 12 інших міст представлені у статті{" "}
      <a href={"https://arxiv.org/pdf/1705.07266.pdf"}>"Public transportation in UK viewed as a complex network"</a>.
      Для отримання повної картини ми відтворили результати двох міст у<Latex>$L\text-space$</Latex> і порівняли їх із
      попередніми даними, пізніше відобразили системи у двох інших вимірах. Погляньте на візуалізацію Брістоля в{" "}
      <Latex>$L$</Latex> просторі . Розмір та колір вузла відображає кількість з'єднань, які від нього відходять. (Задля
      покращення сприйняття інформації проміжні зупинки (зупинки із двома з'єднаннями) не відображаються.)
    </p>

    <p className={b("paragraph")}>
      Ось інша, альтернативна версія того ж L-простору .Кількість зупинок в автобусній мережі Лондона більша за
      брістольську у більш, ніж 6 разів. Тому в L-space також набагато більше вузлів та ребер.
    </p>
  </section>
)

export default Chapter_3
