import React from "react"
import Latex from "react-latex"
import BEM from "../../../helpers/BEM.js"
import "../Article.scss"
import Subchapter_2_3 from "./Subchapter_2_3"
import Subchapter_2_1 from "./Subchapter_2_1"
import Subchapter_2_2 from "./Subchapter_2_2"

const b = BEM("Article")

const Chapter_2 = () => (
  <section>
    <h1 className={b("header")}>Історія трьох міст</h1>
    <Subchapter_2_1 />
    <Subchapter_2_2 />
    <Subchapter_2_3 />
    <p className={b("article")} /> <p className={b("article")} /> <p className={b("article")} />{" "}
    <p className={b("article")} /> <p className={b("article")} /> <h2>Львів</h2>
    <p>Короткий історичний ракурс і проблематики Львова. </p>
    <h3>Цифри.</h3>
    <p className={b("paragraph", ["first"])}>
      Науковці помітили, що набір певних характеристик у багатьох мереж транспорту незалежно від розміру є подібним.
      Однак існують ознаки, між якими часто відсутня кореляція. Для розуміння функціонування мереж та знаходження шляхів
      для їх оптимізації важливо навчитися відслідковувати як наявність, так і відсутність закономірностей.
    </p>
    <p className={b("paragraph")}>
      Для проведення дослідження ми обрали три різні транспортні системи: автобусні маршрути Лондона та Брістоля і
      мережу громадського транспорту Львова. У Лондоні - 767 маршрутів зі 16397 зупинками. Автобусна мережа Брістоля
      налічує 2873 зупинки, які входять до 143 маршрутів. Мережа Львова налічує 100 міських маршрутів, що обслуговують
      771 зупинку. Таким чином ми мали змогу порівняти характеристики трьох різних за розміром та систем.
    </p>
    <h2 className={b("chapter")}>Лондон та Брістоль</h2>
    <p className={b("paragraph", ["first"])}>
      Дослідження для Лондона та Брістоля в <Latex>$L$</Latex> просторі проводили раніше. Ці результати, а також аналіз
      транспортних систем 12 інших міст представлені у статті{" "}
      <a href={"https://arxiv.org/pdf/1705.07266.pdf"}>"Public transportation in UK viewed as a complex network"</a>.
      Для отримання повної картини ми відтворили результати двох міст у<Latex>$L\text-space$</Latex> і порівняли їх із
      попередніми даними, пізніше відобразили системи у двох інших вимірах. Погляньте на візуалізацію Брістоля в{" "}
      <Latex>$L$</Latex> просторі . Розмір та колір вузла відображає кількість з'єднань, які від нього відходять. (Задля
      покращення сприйняття інформації проміжні зупинки (зупинки із двома з'єднаннями) не відображаються.)
    </p>
    <p className={b("paragraph")}>
      Ось інша, альтернативна версія того ж L-простору .Кількість зупинок в автобусній мережі Лондона більша за
      брістольську у більш, ніж 6 разів. Тому в L-space також набагато більше вузлів та ребер.
    </p>
  </section>
)

export default Chapter_2
