import React from "react"
import Latex from "react-latex"
import BEM from "../../../helpers/BEM.js"
import "../Article.scss"
const b = BEM("Article")

const Subchapter_8_1 = () => (
  <section>
    <h1 className={b("header")}>Стійкість мереж до атак</h1>
    <p className={b("paragraph")}>
      9 січня 2017{" "}
      <a href={"https://hromadske.ua/posts/u-londoni-straik-pratsivnykiv-metro-paralizuvav-tsentr-mista"}>
        робітники Лондонського метро вийшли на страйк
      </a>
      . 114 із 270 станцій метрополітену припинили роботу. Ще 75 працювали в обмеженому режимі. Припинення роботи
      найпопулярнішого транспорту в місті призвело до коллапсу. Сотні людей стояли в чергах на автобуси. Залізничні
      маршрути були переповнені. На станції Clapham Junction через скупчення натовпу провели евакуацію. До деяких частин
      міста зникли сполучення. Багато жителів просто не змогли добратись на роботу. Лондонська мережа виявилась не
      готовою до вилучення 114 станцій. А як можна було це передбачити?
    </p>
    <p className={b("paragraph")}>
      Стійкість мережі до вилучення вузлів можна дослідити різними способами. Один із них -{" "}
      <a href={"https://onlinelibrary.wiley.com/doi/abs/10.1002/rsa.3240060204"}>
        критерій Моллоя-Ріда <Latex>{"$ \\kappa $"}</Latex>
      </a>
      . Цей критерій відображає стійкість мережі до випадкових випадінь вузлів.{" "}
      <Latex>{"$ \\kappa = \\frac {\\langle k^2\\rangle} {\\langle k \\rangle}$"}</Latex>, де{" "}
      <Latex>$\langle \kappa \rangle$</Latex> - це середній ступінь вузлів у мережі.
    </p>
    <p className={b("paragraph")}>
      Чим більше значення к, тим стабільнішою є мережа. Вважається, що система є стійкою, якщо{" "}
      <Latex>{"$ \\kappa \\geqslant 2$"}</Latex>. За критерієм Моллоя-Ріда мережі Брістоля і Львова в{" "}
      <Latex>$\mathbb L$</Latex>-, <Latex>$\mathbb P$</Latex>- i <Latex>$\mathbb C$</Latex>-space є стійкими до
      випадкових випадінь вузлів.
    </p>
    {/*add table here*/}
    <p className={b("paragraph")}>
      Однак несправності у мережі бувають не тільки випадковими. Терористичні акти чи страйки спрямовують на
      найважливіші зупинки мережі, щоби зупинити її роботу. Стійкість транспортної системи за різних сценаріїв можна
      перевірити симуляціями атак. У дослідженні ми провели декілька видів симуляцій:
    </p>
    <ul>
      <li>випадкові "випадіння" зупинок</li>
      <li> атаки на вузли із найбільшим ступенем k</li>
      <li>
        {" "}
        атаки на вузли із найбільшою проміжною центральністю <Latex>{"$C_{\\beta}$"}</Latex>
      </li>
    </ul>
    <p className={b("paragraph")}>
      У симуляціях ми поступово видаляємо із мережі 1% від початкової кількості вузлів. Робимо це поки мережа повністю
      не зникне. Зміни в мережі оцінюємо за розміром найбільшої зв’язної компоненти GCC. Найбільша зв’язна компонента -
      це найбільший підграф мережі, у якому між будь-якими двома вузлами є шлях. Після кожного видалення ми рахуємо
      кількість вузлів у GCC відносно початкової кількості вузлів у мережі.
    </p>
    <p className={b("paragraph")}>
      У спрямованих атаках вузли сортують у список за важливістю в порядку спадання. На кожному кроці симуляції вузли
      забирають із початку списку. Після атаки на вузол характеристики його сусідів можуть змінитися. Тому симуляції
      спрямованих атак мають два види:
    </p>
    <ul>
      <li>видалення вузлів без пересортування початкового списку</li>
      <li>видалення вузлів із пересортуванням списку після кожного кроку симуляції</li>
    </ul>
    <p className={b("paragraph")}>
      Після симуляції для кожного виду атак ми створюємо графік залежності розміру GCC від кількості видалених зупинок.
      Далі обраховуємо площу S під графіком. Чим менша S, тим швидше руйнує мережу цей вид атаки.
    </p>
    <p className={b("paragraph")}>Видалення вузла у кожному з відображень має окреме значення.</p>
    <p className={b("paragraph")}>
      <b>
        B <Latex>$\mathbb L$</Latex>-space
      </b>
      : видалення вузла роз’єднує маршрут. Можливо на зупинці трапилась аварія і автомобілі загородили проїзд. Зупинку
      об’їжджають іншими шляхами.
    </p>
    <p className={b("paragraph")}>
      <b>
        В <Latex>$\mathbb P$</Latex>-space
      </b>
      : один вузол забрали із маршруту, але між іншими вузлами того ж маршруту досі є зв’язки. Можливо зупинку вирішили
      відмінити. Автобус проїжджає тією ж дорогою, але більше там не зупиняється.
    </p>
    <p className={b("paragraph")}>
      <b>
        В <Latex>$\mathbb C$</Latex>-space
      </b>
      : маршрут відмінили.
    </p>
  </section>
)

export default Subchapter_8_1
