import React from "react"
import Latex from "react-latex"

import BEM from "../../helpers/BEM.js"
import "./Article.scss"

const b = BEM("Article")

const Chapter_9 = () => (
  <section id={"chapter9"}>
    <h1 className={b("header")}>Висновки</h1>
    <p className={b("paragraph")}>
      Мережі громадського транспорту Брістоля і Львова мають багато спільного. Обидві мережі є стабільними до атак і
      схоже реагують на різні їх види. Випадкові атаки є руйнують мережі найповільніше, а найбільш небезпечними є атаки
      на вузли із найвищою проміжною центральністю (із пересортуванням). Ефективність шляху, діаметри мереж, середня
      кількість пересадок також є подібними. І брістольська і львівська мережі мають відносно невелику середню довжину
      найкоротшого шляху і високі коефіцієнти кластерності. Однак деякі характеристики транспортних систем значно
      відрізняються. Хоча площа Брістоля менша за площу Львова, його кількість зупинок та маршрутів майже вдвічі вища,
      за львівську. У більшості вимірів брістольська мережа має вищі середні і максимальні ступені вузлів. Найбільше
      різницю видно у максимальних ступенях вузлів <Latex>{"$k^{max}$"}</Latex> в <Latex>{"$\\mathbb L$-space"}</Latex>.{" "}
      <Latex>{"$k_{BRS}^{max}$"}</Latex> в 2.5 разів вищий за <Latex>{"$k_{LWO}^{max}$"}</Latex>. Крім того,
      брістольська мережа є стійкішою за львівську до атак на зупинки (атаки в <Latex>{"$\\mathbb L$-space"}</Latex>) і
      менш стійкою до атак на цілі маршрути (атаки в <Latex>{"$\\mathbb C$-space"}</Latex>).
    </p>
  </section>
)

export default Chapter_9
